[
      {
        "id": 1,
        "name": "Chapter 1: Thinking Like a Linguist",
        "subchapters": [
          {
            "id": 1,
            "name": "1.1 Linguistics is Science",
            "paragraphs": [
              {
                "id": 1,
                "text": "This unit introduces the idea of thinking scientifically about language by making empirical observations rather than judgments of correctness."
              },
              {
                "id": 2,
                "text": "Linguistics is one of those subjects that not many people have heard of, so you might well be wondering exactly what it is."
              }
            ]
          },
          {
            "id": 2,
            "name": "Chapter 1.2 Mental Grammar",
            "paragraphs": [
              {
                "id": 1,
                "text": "Linguistics is part of the broad field of cognitive science, which studies the human mind. Linguistics focus specifically on the mental grammar: the system that all speakers of a language have in their minds, which allows them to understand each other. The mental grammar of every language includes phonetics, phonology, morphology, syntax, and semantics."
              }
            ]
          }
        ]
      },
      {
       "id": 2,
        "name": "Chapter 2: Producing Speech Sounds",
        "subchapters": [
          {
            "id": 1,
            "paragraphs": [
              {
                "id": 1, 
                "text": "Phonetics studies human speech. Speech is produced by bringing air from the lungs to the larynx (respiration), where the vocal folds may be held open to allow the air to pass through or may vibrate to make a sound (phonation). The airflow from the lungs is then shaped by the articulators in the mouth and nose (articulation)."
              }, 
              {
                "id": 2,
                "text": "The field of phonetics studies the sounds of human speech.  When we study speech sounds we can consider them from two angles.  Acoustic phonetics,  in addition to being part of linguistics, is also a branch of physics.  It’s concerned with the physical, acoustic properties of the sound waves that we produce.  We’ll talk some about the acoustics of speech sounds, but we’re primarily interested in articulatory phonetics, that is, how we humans use our bodies to produce speech sounds. Producing speech needs three mechanisms."
              }
            ]
          },
          {
            "id": 2,
            "name": "Chapter 2.2 Articulators",
            "paragraphs": [
              {
                "id": 1,
                "text": "Speaking involves controlling parts of the mouth and nose to shape the air that comes from the lungs. This unit introduces the names and locations of the articulators that are used to produce the sounds of English: the tongue, lips and teeth, the alveolar ridge, the palate, the velum, and the nasal cavity."
              }
            ]
          }
        ] 
      }
    ]